<a href="https://colab.research.google.com/github/seunghwan1228/Titanic/blob/master/2)Titanic_preprocess_for_ML.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Preprocessing for ML

In [0]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [0]:
test = pd.read_csv('/content/drive/input/Titanic/working_dir/titanic_test_preprocess_done.csv')
train= pd.read_csv('/content/drive/input/Titanic/working_dir/titanic_train_preprocess_done.csv')

In [0]:
train.head()

   PassengerId  Survived  Pclass  ... age_bin   lastname  surname_clf
0            1         0       3  ...       3     Braund           Mr
1            2         1       1  ...       4    Cumings          Mrs
2            3         1       3  ...       3  Heikkinen         Miss
3            4         1       1  ...       4   Futrelle          Mrs
4            5         0       3  ...       4      Allen           Mr

[5 rows x 14 columns]

In [0]:
test.head()

   PassengerId  Pclass  ...  lastname surname_clf
0          892       3  ...     Kelly          Mr
1          893       3  ...    Wilkes         Mrs
2          894       2  ...     Myles          Mr
3          895       3  ...      Wirz          Mr
4          896       3  ...  Hirvonen         Mrs

[5 rows x 13 columns]

# required to preprocess cabin or customer

In [0]:
cabin_lambda = lambda x : 0 if x == 'customer' else 1

In [0]:
train['cabin_class'] = train.Cabin.apply(cabin_lambda)

In [0]:
test['cabin_class'] = test.Cabin.apply(cabin_lambda)

In [0]:
train.head()

   PassengerId  Survived  Pclass  ...   lastname surname_clf  cabin_class
0            1         0       3  ...     Braund          Mr            0
1            2         1       1  ...    Cumings         Mrs            1
2            3         1       3  ...  Heikkinen        Miss            0
3            4         1       1  ...   Futrelle         Mrs            1
4            5         0       3  ...      Allen          Mr            0

[5 rows x 15 columns]

In [0]:
train['cabin_class'] = train.cabin_class.astype('category')

remove duplicate feature

In [0]:
train.drop('Cabin', axis = 1 , inplace=True)
test.drop('Cabin', axis=1, inplace=True)

remove duplicated features

In [0]:
test.drop('Name', axis = 1, inplace =True)
train.drop('Name', axis = 1, inplace =True)

for insecure, save the Age columns

In [0]:
test_only_age = test.Age
train_only_age = train.Age

train.drop('Age', axis=1, inplace=True)
test.drop('Age', axis=1, inplace =True)

remove suname - duplicated

drop passengerId

In [0]:
train.drop('PassengerId', axis=1, inplace=True)
test.drop('PassengerId', axis=1, inplace=True)

In [0]:
train.head()

   Survived  Pclass     Sex  SibSp  ...  age_bin   lastname surname_clf  cabin_class
0         0       3    male      1  ...        3     Braund          Mr            0
1         1       1  female      1  ...        4    Cumings         Mrs            1
2         1       3  female      0  ...        3  Heikkinen        Miss            0
3         1       1  female      1  ...        4   Futrelle         Mrs            1
4         0       3    male      0  ...        4      Allen          Mr            0

[5 rows x 11 columns]

In [0]:
test.head()

   Pclass     Sex  SibSp  Parch  ...  age_bin  lastname  surname_clf cabin_class
0       3    male      0      0  ...        4     Kelly           Mr           0
1       3  female      1      0  ...        5    Wilkes          Mrs           0
2       2    male      0      0  ...        5     Myles           Mr           0
3       3    male      0      0  ...        3      Wirz           Mr           0
4       3  female      1      1  ...        3  Hirvonen          Mrs           0

[5 rows x 10 columns]

In [0]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
Survived       891 non-null int64
Pclass         891 non-null int64
Sex            891 non-null object
SibSp          891 non-null int64
Parch          891 non-null int64
Fare           891 non-null float64
Embarked       891 non-null object
age_bin        891 non-null int64
lastname       891 non-null object
surname_clf    891 non-null object
cabin_class    891 non-null category
dtypes: category(1), float64(1), int64(5), object(4)
memory usage: 70.7+ KB

change the data types

In [0]:
to_category = ['Pclass', 'Sex', 'Embarked', 'age_bin', 'lastname', 'surname_clf', 'cabin_class', 'SibSp', 'Parch']

In [0]:
for i in to_category:
  test[i] = test[i].astype('category')
  
for i in to_category:
  train[i] = train[i].astype('category')

In [0]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 10 columns):
Pclass         891 non-null category
Sex            891 non-null category
SibSp          891 non-null category
Parch          891 non-null category
Fare           891 non-null float64
Embarked       891 non-null category
age_bin        891 non-null category
lastname       891 non-null category
surname_clf    891 non-null category
cabin_class    891 non-null category
dtypes: category(9), float64(1)
memory usage: 42.5 KB

In [0]:
test.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 10 columns):
Pclass         418 non-null category
Sex            418 non-null category
SibSp          418 non-null category
Parch          418 non-null category
Fare           418 non-null float64
Embarked       418 non-null category
age_bin        418 non-null category
lastname       418 non-null category
surname_clf    418 non-null category
cabin_class    418 non-null category
dtypes: category(9), float64(1)
memory usage: 21.7 KB

## split the label

In [0]:
train_y = train.Survived
train.drop('Survived', axis=1, inplace=True)

# preprocess for ML,

*  text featrue, dummy encoding

* numeric feature, scaling

In [0]:
from sklearn.preprocessing import StandardScaler
from sklearn.pipeline import Pipeline, FeatureUnion
from sklearn.preprocessing import FunctionTransformer

Drop the target feature : Survived

In [0]:
train.head()

  Pclass     Sex SibSp Parch  ...  age_bin   lastname surname_clf cabin_class
0      3    male     1     0  ...        3     Braund          Mr           0
1      1  female     1     0  ...        4    Cumings         Mrs           1
2      3  female     0     0  ...        3  Heikkinen        Miss           0
3      1  female     1     0  ...        4   Futrelle         Mrs           1
4      3    male     0     0  ...        4      Allen          Mr           0

[5 rows x 10 columns]

In [0]:
test.head()

  Pclass     Sex SibSp Parch  ...  age_bin  lastname surname_clf cabin_class
0      3    male     0     0  ...        4     Kelly          Mr           0
1      3  female     1     0  ...        5    Wilkes         Mrs           0
2      2    male     0     0  ...        5     Myles          Mr           0
3      3    male     0     0  ...        3      Wirz          Mr           0
4      3  female     1     1  ...        3  Hirvonen         Mrs           0

[5 rows x 10 columns]

In [0]:
train_y[:10]

0    0
1    1
2    1
3    1
4    0
5    0
6    0
7    0
8    1
9    1
Name: Survived, dtype: int64

In [0]:
print(train.info())
print('------------------------------------------------------------------')
print(test.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 10 columns):
Pclass         891 non-null category
Sex            891 non-null category
SibSp          891 non-null category
Parch          891 non-null category
Fare           891 non-null float64
Embarked       891 non-null category
age_bin        891 non-null category
lastname       891 non-null category
surname_clf    891 non-null category
cabin_class    891 non-null category
dtypes: category(9), float64(1)
memory usage: 42.5 KB
None
------------------------------------------------------------------
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 10 columns):
Pclass         418 non-null category
Sex            418 non-null category
SibSp          418 non-null category
Parch          418 non-null category
Fare           418 non-null float64
Embarked       418 non-null category
age_bin        418 non-null category
lastname       418 non-null category
surname_clf    418 non-null category
cabin_class    418 non-null category
dtypes: category(9), float64(1)
memory usage: 21.7 KB
None

there are differences in train and test set in Parch,
requires to put the test set's 9 to six

In [0]:
train.Parch.value_counts().sort_index()

0    678
1    118
2     80
3      5
4      4
5      5
6      1
Name: Parch, dtype: int64

In [0]:
test.Parch.value_counts().sort_index()

0    324
1     52
2     33
3      3
4      2
5      1
6      1
9      2
Name: Parch, dtype: int64

In [0]:
test['Parch'] = test.Parch.astype('int')

test.loc[test['Parch']==9, 'Parch'] = 6

In [0]:
test.Parch.value_counts()

0    324
1     52
2     33
6      3
3      3
4      2
5      1
Name: Parch, dtype: int64

In [0]:
test['Parch'] = test.Parch.astype('category')

# to normalize, drop lastname

In [0]:
train.drop('lastname', axis=1, inplace=True)
test.drop('lastname', axis=1, inplace=True)

In [0]:
to_category = ['Pclass', 'Sex', 'Embarked', 'age_bin', 'surname_clf', 'cabin_class', 'SibSp', 'Parch']

In [0]:
test_dummy = pd.get_dummies(test, columns=to_category, drop_first=True)
train_dummy = pd.get_dummies(train, columns=to_category, drop_first=True)

In [0]:
display(train_dummy.head())
print(train_dummy.shape)

      Fare  Pclass_2  Pclass_3  Sex_male  ...  Parch_3  Parch_4  Parch_5  Parch_6
0   7.2500         0         1         1  ...        0        0        0        0
1  71.2833         0         0         0  ...        0        0        0        0
2   7.9250         0         1         0  ...        0        0        0        0
3  53.1000         0         0         0  ...        0        0        0        0
4   8.0500         0         1         1  ...        0        0        0        0

[5 rows x 29 columns]

(891, 29)

In [0]:
display(test_dummy.head())
print(test_dummy.shape)

      Fare  Pclass_2  Pclass_3  Sex_male  ...  Parch_3  Parch_4  Parch_5  Parch_6
0   7.8292         0         1         1  ...        0        0        0        0
1   7.0000         0         1         0  ...        0        0        0        0
2   9.6875         1         0         1  ...        0        0        0        0
3   8.6625         0         1         1  ...        0        0        0        0
4  12.2875         0         1         0  ...        0        0        0        0

[5 rows x 29 columns]

(418, 29)

save the dummy coded train / test set

In [0]:
train_dummy.to_csv('/content/drive/input/Titanic/working_dir/train_dummy.csv', index = False)
test_dummy.to_csv('/content/drive/input/Titanic/working_dir/test_dummy.csv', index = False)

## should put `validate=False`

In [0]:
get_numeric = FunctionTransformer(lambda x: x['Fare'].values.reshape(-1,1), validate=False)

In [0]:
preprocess = Pipeline([('numeric', get_numeric),
                       ('scaler', StandardScaler())])

In [0]:
preprocess.fit(train_dummy)
train_scaling = preprocess.transform(train_dummy)

In [0]:
preprocess2 = Pipeline([('numeric', get_numeric),
                       ('scaler', StandardScaler())])

test_scaling = preprocess2.fit_transform(test_dummy)

In [0]:
train_dummy_preprocess = train_dummy.drop('Fare', axis=1).values
test_dummy_preprocess = test_dummy.drop('Fare', axis=1).values

In [0]:
train_dummy_preprocess
print(train_dummy_preprocess.shape)

(891, 28)

In [0]:
test_dummy_preprocess
print(test_dummy_preprocess.shape)

(418, 28)

In [0]:
train = np.concatenate([train_scaling, train_dummy_preprocess], axis=1)
test = np.concatenate([test_scaling, test_dummy_preprocess], axis=1)

In [0]:
train.shape

(891, 29)

In [0]:
test.shape

(418, 29)

In [0]:
train

array([[-0.50244517,  0.        ,  1.        , ...,  0.        ,
         0.        ,  0.        ],
       [ 0.78684529,  0.        ,  0.        , ...,  0.        ,
         0.        ,  0.        ],
       [-0.48885426,  0.        ,  1.        , ...,  0.        ,
         0.        ,  0.        ],
       ...,
       [-0.17626324,  0.        ,  1.        , ...,  0.        ,
         0.        ,  0.        ],
       [-0.04438104,  0.        ,  0.        , ...,  0.        ,
         0.        ,  0.        ],
       [-0.49237783,  0.        ,  1.        , ...,  0.        ,
         0.        ,  0.        ]])

In [0]:
test

array([[-0.49731093,  0.        ,  1.        , ...,  0.        ,
         0.        ,  0.        ],
       [-0.5121751 ,  0.        ,  1.        , ...,  0.        ,
         0.        ,  0.        ],
       [-0.46399919,  1.        ,  0.        , ...,  0.        ,
         0.        ,  0.        ],
       ...,
       [-0.50769362,  0.        ,  1.        , ...,  0.        ,
         0.        ,  0.        ],
       [-0.49335289,  0.        ,  1.        , ...,  0.        ,
         0.        ,  0.        ],
       [-0.23686347,  0.        ,  1.        , ...,  0.        ,
         0.        ,  0.        ]])

In [0]:
train_df = pd.DataFrame(train)
test_df = pd.DataFrame(test)

In [0]:
label_df = pd.DataFrame(train_y)
label_df.reset_index(inplace=True)
label_df.drop('index', axis=1, inplace=True)

In [0]:
display(train_df.head())
display(test_df.head())

         0    1    2    3    4    5    6   ...   22   23   24   25   26   27   28
0 -0.502445  0.0  1.0  1.0  0.0  1.0  0.0  ...  0.0  0.0  0.0  0.0  0.0  0.0  0.0
1  0.786845  0.0  0.0  0.0  0.0  0.0  0.0  ...  0.0  0.0  0.0  0.0  0.0  0.0  0.0
2 -0.488854  0.0  1.0  0.0  0.0  1.0  0.0  ...  0.0  0.0  0.0  0.0  0.0  0.0  0.0
3  0.420730  0.0  0.0  0.0  0.0  1.0  0.0  ...  0.0  0.0  0.0  0.0  0.0  0.0  0.0
4 -0.486337  0.0  1.0  1.0  0.0  1.0  0.0  ...  0.0  0.0  0.0  0.0  0.0  0.0  0.0

[5 rows x 29 columns]

         0    1    2    3    4    5    6   ...   22   23   24   25   26   27   28
0 -0.497311  0.0  1.0  1.0  1.0  0.0  0.0  ...  0.0  0.0  0.0  0.0  0.0  0.0  0.0
1 -0.512175  0.0  1.0  0.0  0.0  1.0  0.0  ...  0.0  0.0  0.0  0.0  0.0  0.0  0.0
2 -0.463999  1.0  0.0  1.0  1.0  0.0  0.0  ...  0.0  0.0  0.0  0.0  0.0  0.0  0.0
3 -0.482373  0.0  1.0  1.0  0.0  1.0  0.0  ...  0.0  0.0  0.0  0.0  0.0  0.0  0.0
4 -0.417392  0.0  1.0  0.0  0.0  1.0  0.0  ...  0.0  1.0  0.0  0.0  0.0  0.0  0.0

[5 rows x 29 columns]

In [0]:
display(label_df.head())

   Survived
0         0
1         1
2         1
3         1
4         0

In [0]:
train_label = pd.concat([train_df, label_df], axis = 1)

save the work process

In [0]:
train_label.to_csv('/content/drive/input/Titanic/working_dir/train_final.csv', index = False)
test_df.to_csv('/content/drive/input/Titanic/working_dir/test_final.csv', index = False)